fixtures/vcr_cassettes/end_stripe_trial_subscription.yml

---
http_interactions:
- request:
    method: post
    uri: https://api.stripe.com/v1/subscriptions/sub_9bEuot1cvCrYHe
    body:
      encoding: UTF-8
      string: trial_end=now
    headers:
      Accept:
      - "*/*"
      Accept-Encoding:
      - gzip, deflate
      User-Agent:
      - Stripe/v1 RubyBindings/1.55.0
      Authorization:
      - Bearer sk_test_1edJffGpWL6BsWNjzicAe9R2
      Content-Type:
      - application/x-www-form-urlencoded
      Idempotency-Key:
      - 9b440f77-2bc9-48cc-aae4-c4af9a45aa48
      X-Stripe-Client-User-Agent:
      - '{"bindings_version":"1.55.0","lang":"ruby","lang_version":"2.3.1 p112 (2016-04-26)","platform":"x86_64-darwin15","engine":"ruby","publisher":"stripe","uname":"Darwin
        Ricardos-MBP 15.2.0 Darwin Kernel Version 15.2.0: Fri Nov 13 19:56:56 PST
        2015; root:xnu-3248.20.55~2/RELEASE_X86_64 x86_64","hostname":"Ricardos-MBP"}'
      Content-Length:
      - '13'
      Host:
      - api.stripe.com
  response:
    status:
      code: 200
      message: OK
    headers:
      Server:
      - nginx
      Date:
      - Sun, 20 Nov 2016 21:01:21 GMT
      Content-Type:
      - application/json
      Content-Length:
      - '807'
      Connection:
      - keep-alive
      Access-Control-Allow-Credentials:
      - 'true'
      Access-Control-Allow-Methods:
      - GET, POST, HEAD, OPTIONS, DELETE
      Access-Control-Allow-Origin:
      - "*"
      Access-Control-Max-Age:
      - '300'
      Cache-Control:
      - no-cache, no-store
      Idempotency-Key:
      - 9b440f77-2bc9-48cc-aae4-c4af9a45aa48
      Original-Request:
      - req_9bEvIZnlS53NmF
      Request-Id:
      - req_9bEvIZnlS53NmF
      Stripe-Version:
      - '2016-07-06'
      Strict-Transport-Security:
      - max-age=31556926; includeSubDomains
    body:
      encoding: UTF-8
      string: |
        {
          "id": "sub_9bEuot1cvCrYHe",
          "object": "subscription",
          "application_fee_percent": null,
          "cancel_at_period_end": false,
          "canceled_at": null,
          "created": 1479675677,
          "current_period_end": 1482267680,
          "current_period_start": 1479675680,
          "customer": "cus_9bEuPWNAuVQOmk",
          "discount": null,
          "ended_at": null,
          "livemode": false,
          "metadata": {},
          "plan": {
            "id": "advanced",
            "object": "plan",
            "amount": 4900,
            "created": 1468799819,
            "currency": "usd",
            "interval": "month",
            "interval_count": 1,
            "livemode": false,
            "metadata": {},
            "name": "Advanced",
            "statement_descriptor": null,
            "trial_period_days": null
          },
          "quantity": 1,
          "start": 1479675681,
          "status": "active",
          "tax_percent": null,
          "trial_end": null,
          "trial_start": null
        }
    http_version: 
  recorded_at: Sun, 20 Nov 2016 21:01:21 GMT
recorded_with: VCR 3.0.3
